MobileInfoBase/src/InformationRegisters/Д_ФотоДоставок/Д_ФотоДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Д_ФотоДоставок</name>
  <comment>mroc-diplom</comment>
  <resources>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.Д_Доставка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

MobileInfoBase/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Д_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MobileInfoBase/src/Documents/Д_Доставка/Д_Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Д_Доставка</name>
  <comment>ДЗ-12-1-1</comment>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Д_СтатусыДоставок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоДоставки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MobileInfoBase/src/HTTPServices/Д_ОбменСМобильнымКлиентом/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция pingПроверитьСоединение(Запрос)
//Володин А.А. 
//Задача 2 ДЗ Базовые подсистемы 
//18 октября 2024 г.	
	Текст = СтрШаблон("%1. %2", Пользователи.ТекущийПользователь(), ТекущаяДата());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(Текст);
		
	Возврат Ответ;
//Конец вставки от 18 октября 2024 г.
КонецФункции

Функция deliveryПолучитьДоставки(Запрос)
//Начало Володин А.А. 23 октября 2024 г.
//Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства
	Ответ = Новый HTTPСервисОтвет(200);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ответственный = &ТекущийПользователь";
	
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТелоОтвета = РезультатЗапроса.Выгрузить().Количество();
	
	//ТелоОтвета = ЗаписатьЗначениеJSON(МассивДляОтправки); //Метод работает начиная с версии 8.3.23
	//ЗаписьJSON = Новый ЗаписьJSON;
	//ЗаписьJSON.УстановитьСтроку();
	//ЗаписатьJSON(ЗаписьJSON, МассивДляОтправки);
	//ТелоОтвета = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		
	Возврат Ответ; 
//Конец Володин А.А. 23 октября 2024 г.
КонецФункции

Функция ExchangeDeliveryПолучитьСписокДоставок(Запрос)
//Начало Володин А.А. 27 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	УстановитьПривилегированныйРежим(Истина);
	
	//Получим сведения об устройстве, запрашивающем обмен:
	ИДУстройства = Запрос.Заголовки.Получить("x_MobileID");
	
	//Найдем план обмена для подкдючившегося устройства:
	Узел = ПланыОбмена.Д_ОбменСМобильнымУстройством.НайтиПоКоду(ИДУстройства);
	
	//Созданим новый узел плана обмена, если устройство ранее не регистрировалось в плане обмена:
	Если Не ЗначениеЗаполнено(Узел) Тогда
		
		НовыйУзел = ПланыОбмена.Д_ОбменСМобильнымУстройством.СоздатьУзел();
		НовыйУзел.Код = ИДУстройства;
		НовыйУзел.Наименование = ИДУстройства;
		НовыйУзел.Пользователь = Пользователи.ТекущийПользователь();
		НовыйУзел.Записать();
		
		Узел = НовыйУзел.Ссылка;
		
		ВыполнитьПервичнуюРегистрацию(Узел);
		
	КонецЕсли;
	
	//Проверим заполнены ли данные узла центральной базы:
	ТекущийУзел = ПланыОбмена.Д_ОбменСМобильнымУстройством.ЭтотУзел();
	
	Если Не ЗначениеЗаполнено(ТекущийУзел.Код) Тогда
		
		ЦентральныйУзел = ТекущийУзел.ПолучитьОбъект();
		ЦентральныйУзел.Код = "main";
		ЦентральныйУзел.Наименование = "Центральный узел";
		ЦентральныйУзел.Записать();
		
	КонецЕсли;
	
	//Получим зарегистрированные данные:
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Д_ДоставкаИзменения.Ссылка КАК Ссылка,
		|	Д_ДоставкаИзменения.Ссылка.Контрагент КАК КонтрагентНаименование,
		|	Д_ДоставкаИзменения.Ссылка.АдресДоставки КАК АдресДоставки,
		|	Д_ДоставкаИзменения.Ссылка.Комментарий КАК Комментарий,
		|	Д_ДоставкаИзменения.Ссылка.Товары.(
		|		Номенклатура КАК НоменклатураНаименование,
		|		Количество КАК Количество,
		|		Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|		Номенклатура.Ссылка КАК НоменклатураСсылка
		|	) КАК Товары,
		|	Д_ДоставкаИзменения.Ссылка.Статус КАК Статус,
		|	Д_ДоставкаИзменения.Ссылка.Номер КАК Номер,
		|	Д_ДоставкаИзменения.Ссылка.Дата КАК Дата,
		|	Д_ДоставкаИзменения.Ссылка.Контрагент.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	Документ.Д_Доставка.Изменения КАК Д_ДоставкаИзменения
		|ГДЕ
		|	Д_ДоставкаИзменения.Узел = &Узел";
	
	Запрос.УстановитьПараметр("Узел", Узел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивДляОтправки = Новый Массив;
	МассивДляОтменыРегистрации = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ДокументДоставки = Новый Структура;
		ДокументДоставки.Вставить("Ссылка", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		ДокументДоставки.Вставить("Номер", Выборка.Номер);
		ДокументДоставки.Вставить("Дата", Строка(Выборка.Дата));
		ДокументДоставки.Вставить("КонтрагентСсылка", Строка(Выборка.КонтрагентСсылка.Ссылка.УникальныйИдентификатор()));
		ДокументДоставки.Вставить("КонтрагентНаименование", Строка(Выборка.КонтрагентНаименование));
		ДокументДоставки.Вставить("АдресДоставки", Выборка.АдресДоставки);
		ДокументДоставки.Вставить("Комментарий", Выборка.Комментарий);
		ДокументДоставки.Вставить("Статус", Строка(Выборка.Статус));
		
		//Сформируем выборку табличной части документа:
		ВыборкаТовары = Выборка.Товары.Выбрать();
		//Т.к. в JSON можно добавлять только примитивные типы, сторки ТЧ будем добавлять ввиде Структур в Массив:
		ТаблицаТовары = Новый Массив;
		//Обойдем полученную выборку и добавим структуры с содержанием строк в массив:
		Пока ВыборкаТовары.Следующий() Цикл
			
			СтрокаТаблицыТовары = Новый Структура;
			СтрокаТаблицыТовары.Вставить("НоменклатураСсылка", Строка(ВыборкаТовары.НоменклатураСсылка.Ссылка.УникальныйИдентификатор()));
			СтрокаТаблицыТовары.Вставить("НоменклатураНаименование", Строка(ВыборкаТовары.НоменклатураНаименование));
			СтрокаТаблицыТовары.Вставить("ВидНоменклатуры", Строка(ВыборкаТовары.ВидНоменклатуры));
			СтрокаТаблицыТовары.Вставить("Количество", ВыборкаТовары.Количество);
			
			ТаблицаТовары.Добавить(СтрокаТаблицыТовары);
			
		КонецЦикла;
		//Добавми полученный массив структур со строками в структуру документа подготавлеваемого к отправке:
		ДокументДоставки.Вставить("Товары", ТаблицаТовары);
		//Структуру документа в свою очередь добавим в массив для отправки:
		МассивДляОтправки.Добавить(ДокументДоставки);
		//Добавим в МассивДляОтменыРегистрации ссылку на подготовленный к отправке документ:
		МассивДляОтменыРегистрации.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	//Сериализуем зарегистрированные данные:
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивДляОтправки);
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	//Отменим регистрацию изменений если в массиве что-то есть:
	Если МассивДляОтменыРегистрации.Количество() <> 0 Тогда
		
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, МассивДляОтменыРегистрации); //Метод не проверяет статус ответа. Удаляет данные для регистрации не зависимо от успешности обмена.
		
	КонецЕсли;
	
	Возврат Ответ;
//Конец Володин А.А. 27 октября 2024 г.
КонецФункции

Процедура ВыполнитьПервичнуюРегистрацию(Узел)
//Начало Володин А.А. 27 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Д_Доставка.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Д_Доставка КАК Д_Доставка
		|ГДЕ
		|	Д_Доставка.Ответственный = &Ответственный
		|	И НЕ Д_Доставка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ответственный", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	ДанныеКРегистрации = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеКРегистрации.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, ДанныеКРегистрации);
//Конец Володин А.А. 27 октября 2024 г.
КонецПроцедуры

Функция ExchangeDeliveryДобавитьФотоДоставки(Запрос)
//Начало Володин А.А. 08 ноября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	УстановитьПривилегированныйРежим(Истина);
	
	//Получим сведения об устройстве, запрашивающем обмен:
	ИДУстройства = Запрос.Заголовки.Получить("x_MobileID");
	
	//Найдем план обмена для подкдючившегося устройства:
	Узел = ПланыОбмена.Д_ОбменСМобильнымУстройством.НайтиПоКоду(ИДУстройства);
	
	//Созданим новый узел плана обмена, если устройство ранее не регистрировалось в плане обмена:
	Если Не ЗначениеЗаполнено(Узел) Тогда
		
		НовыйУзел = ПланыОбмена.Д_ОбменСМобильнымУстройством.СоздатьУзел();
		НовыйУзел.Код = ИДУстройства;
		НовыйУзел.Наименование = ИДУстройства;
		НовыйУзел.Пользователь = Пользователи.ТекущийПользователь();
		НовыйУзел.Записать();
		
		Узел = НовыйУзел.Ссылка;
		
		ВыполнитьПервичнуюРегистрацию(Узел);
		
	КонецЕсли;
	
	//Проверим заполнены ли данные узла центральной базы:
	ТекущийУзел = ПланыОбмена.Д_ОбменСМобильнымУстройством.ЭтотУзел();
	
	Если Не ЗначениеЗаполнено(ТекущийУзел.Код) Тогда
		
		ЦентральныйУзел = ТекущийУзел.ПолучитьОбъект();
		ЦентральныйУзел.Код = "main";
		ЦентральныйУзел.Наименование = "Центральный узел";
		ЦентральныйУзел.Записать();
		
	КонецЕсли;
	
	//МассивДоставок = ПрочитатьЗначениеJSON(ОтветСервераСтрока); //Метод доступен начиная с версии 8.3.23
	ТекстJSON = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON); //Сюда нужно добавить тело запроса
	МассивДоставок = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	КоличествоЗагруженныхФото = 0;
	
	Для Каждого Доставка Из МассивДоставок Цикл
		
		//Получим ссылки на документ Доставка и Контрагента:
		ИДДоставки = Новый УникальныйИдентификатор(Доставка.Ссылка);
		
		СсылкаДоставка = Документы.Д_Доставка.ПолучитьСсылку(ИДДоставки);
		
		//Получим объекты документа доставка по ссылке:
		ОбъектДоставка = СсылкаДоставка.ПолучитьОбъект();
		
		//Проверим есть ли такой документ в нашей базе:
		Если ОбъектДоставка = Неопределено Тогда
			
			Ответ = Новый HTTPСервисОтвет(500);
			Ответ.УстановитьТелоИзСтроки(СтрШаблон("Переданный документ отсутствует в базе: %1", СсылкаДоставка));
			
			Возврат Ответ;
			
		Иначе
			
			ОбъектДоставка = СсылкаДоставка.ПолучитьОбъект();
			
			//Внесем изменения в существующий:
			ОбъектДоставка.Комментарий = Доставка.Комментарий;
			ОбъектДоставка.Статус = Перечисления.Д_СтатусыДоставок[СтрЗаменить(Доставка.Статус, " ", "")];
			ОбъектДоставка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			//Запишем двоичные данные фото в регистр по принадлежности ссылки на документ:
			МенеджерЗаписи = РегистрыСведений.Д_ФотоДоставок.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Доставка = ОбъектДоставка.Ссылка;
			
			ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(Доставка.ФотоДоставки);
			
			Если ДвоичныеДанные = Неопределено Тогда
				
				МенеджерЗаписи.Фотография = Новый ХранилищеЗначения(Неопределено);
				
			Иначе
				
				МенеджерЗаписи.Фотография = Новый ХранилищеЗначения(ДвоичныеДанные); 
				
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
			
			КоличествоЗагруженныхФото = КоличествоЗагруженныхФото + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(КоличествоЗагруженныхФото);
	
	Возврат Ответ;
//Конец Володин А.А. 08 ноября 2024 г.
КонецФункции

#КонецОбласти
